{"info":{"partnerName":"B&B Italia","name":"Almora","productURL":"http://www.bebitalia.com/en/","height":"78 cm","width":"48 cm","depth":"54 cm","partnerId":"nyM4","images":{"brand":"a/hKeysCDiPuqMVeKAciPAI4QUb7c.png","thumb":["a/bWICTSEPR5G_x6YvSTGHJGEMQBA.jpg"]},"customerId":"ME48","description":"ALMORA - design Doshi & Levien<br><br>Named after the Indian region that offers a breathtaking view of the Himalayan Mountains and, quoting its designers, it longs to be “a haven from the world, a place for contemplation and reading from where one can admire magnificent snow-capped peaks. As protective as a second skin, enveloping like a soft blanket.” ALMORA belongs with full rights to the type of armchairs that play the protagonists at home, as they offer relaxation and evoke symbolic meanings associated with warmth, the nest, the womb and hospitality. ALMORA includes two frames, one for the seat<br><br>and one for the back, both conical and made of white painted plastic. They are placed on a swivel base with five spokes in cast aluminum. A third element is the headrest made of curved oak wood padded on the inner side. Inserted into the chair back, it gives the impression of being slightly detached.<br><br>The most interesting formal feature lies in the balanced composition of the various elements, materials and covers that can be upholstered in fabric, leather and shearling.<br><br>The superimposed headrest, back and seat are piled on an invisible mechanical joint. Every detail is studied like a tailor-made garment. An ottoman with round base and partly padded curved wooden seat acts as a footstool.<br><br>Almora marks the debut of a new partnership between B&B Italia and the London-based firm Doshi-Levien, which was established through the partnership formed between Nipa Doshi of Indian origin and Jonathan Levien, Scottish from Scotland, both graduates from the Royal College of Art.<br><br>They have distinguished themselves over the past decade for their original approach, which converges technology and craftsmanship, artistic vision with a multi faceted cultural outlook."},"status":"ENABLED","id":"Kmq9"}