{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23154926.png","Dimensions":"220 cm x 74 cm x 100 cm","name":"Carpenters Dining Table 220x100cm (PI)","tags":["Freedom:Menu:Dining:Dining Tables"],"price":"$1499","LongDescription":"Inspired by the shape of a trestle table, the Carpenters dining table offers all the simplicity of a workman’s bench but offers subtle sophistication in look and construction. The A-frame trestle table legs lock into a groove in the extra thick tabletop, which is made from solid elm planks. These details may not seem much, but it’s what sets this solid timber dining table apart from others of its type. Suited to either a modern country décor, or a home in which an industrial look is on show, the Carpenters dining table will certainly make a statement in any dining room. Pull up six ultra modern chairs to complete the look.\r\n\r\n“With its mellow elm wood surface and sculptural trestle legs, the Carpenters dining table is a piece of furniture that should always be on show.” Freedom dining table buyer. \r\n","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/23154926/carpenters-dining-table-220x100cm-natural/","productURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/23154926/carpenters-dining-table-220x100cm-natural/","partnerId":"MRqq","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/cKi5XLifGBaM038-JK4zbRMsh6A.jpg"],"thumb":["a/FP4_0RxxXcsLM54VpNnOoVWPb9g.jpg"]},"customerId":"23154926","description":"<p>Inspired by the shape of a trestle table, the Carpenters dining table offers all the simplicity of a workman&#8217;s bench but offers subtle sophistication in look and construction. The A-frame trestle table legs lock into a groove in the extra thick tabletop, which is made from solid elm planks. These details may not seem much, but it&#8217;s what sets this solid timber dining table apart from others of its type. Suited to either a modern country d&#233;cor, or a home in which an industrial look is on show, the Carpenters dining table will certainly make a statement in any dining room. Pull up six ultra modern chairs to complete the look.<br />&#13;\n<br />&#13;\n&#8220;With its mellow elm wood surface and sculptural trestle legs, the Carpenters dining table is a piece of furniture that should always be on show.&#8221; Freedom dining table buyer. &#13;\n</p>&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/23154926/carpenters-dining-table-220x100cm-natural/","id":"nTd7"}