{"info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23351691.png","Dimensions":"163 cm x 120 cm x 217 cm","name":"Henderson Bed Queen (PI)","tags":["Freedom:Menu:Bedroom:Beds"],"price":"$1299","LongDescription":"OVERVIEW\r\nThere are no handles or knobs to disturb the clean lines and graceful proportions of the Henderson one-drawer side table. Its simple functional design provides a perfect storage solution in the bedroom or living room, and the characteristic shadowline around the bevelled-edged drawer is a design detail repeated throughout the Henderson range. \r\nIndividually crafted, the bedside table features solid chestnut timber and timber veneers which show off a softly hued natural grain. Attractive and sturdy, this bedside table is part of Henderson’s coordinated furniture range, a range that is perfectly suited to a chic, contemporary style of decor.\r\n“The simple design and natural grained timber of the Henderson range is  as close as it comes to a true Australian style,” Freedom  sofa buyer. \r\n","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/bedroom/beds/23351691/henderson-queen-bed-natural/","productURL":"http://www.freedomfurniture.co.nz/furniture/bedroom/beds/23351691/henderson-queen-bed-natural/","partnerId":"MRqq","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/S5Z6d_8OZCGG3of0DM9pUx8cd5U.jpg"],"thumb":["a/8zio-vHcmj3J43ihsJ-r8CUxz6I.jpg"]},"customerId":"23351691","description":"The simple design profile of the Henderson queen bed suits a bright and modern bedroom. A clear lacquer finish on the softly hued solid chestnut timber and timber veneers shows off the natural grain. Available in two sizes of queen and king, each bed is individually crafted and displays a characteristic recessed shadowline on the bedhead and bedfoot. Attractive and sturdy, this queen bed is part of Henderson’s coordinated furniture range, a range that is perfectly suited to a chic, contemporary style of decor."},"status":"ENABLED","productURL":"http://www.freedomfurniture.co.nz/furniture/bedroom/beds/23351691/henderson-queen-bed-natural/","id":"P4qV"}