{"info":{"partnerName":"Blueport Commerce","diameter":"48\"","fcomId":"1612112","name":"Chelsea 5 Pc. Dinette","asfURL":"http://www.americansignaturefurniture.com/shared/pages/product/product.aspx?ItemId=0&ChildItemId=1580771","tags":["Modeller:1","Blueport Commerce:ItemEnrollDate:2013-10-31 00:00:00","Blueport Commerce:Brand:American Signature","Blueport Commerce:Menu:Dining Rooms:Package Specials"],"images":{"brand":"a/8TQ3txy57UyIuBnAxMXDKKdboCI.png","full":["a/6ca1027bc1d5e7e1c9462a9307ba55b6fbfd02b4.jpg","a/3a4fa3d0e512c6b0f10be9df99c173fa8497c922.jpg","a/b88355e85e4291fd633b4015edc0462fc76dc3dd.jpg","a/ba833158e097f26b82f98ea60892addf0a01b806.jpg","a/432c5edd8480faee5a6d7d9281ab8c9449890dad.jpg"],"thumb":["a/ae88d33d442e39b72f134bcd3a58ab49065c30b4.jpg"]},"fcomRCopy":"On Target. With its lovely pairing of cherry wood tones and black paint, the Cunningham dining room will be the perfect spot for intimate gatherings. The round table has a substantial turned pedestal base, curved edge bevel and plinth-style feet. The uniquely styled chairs feature a modified X-style back with a central ring, slender, tapering legs and a shaped seat for extra dining comfort. When the look needs to be a seamless blend of classic and casual, the Cunningham collection hits the bull's-eye. Five piece package includes table and four chairs, as shown.","fcomURL":"http://www.furniture.com/shared/pages/product/product.aspx?ItemId=0&ChildItemId=1612112","partnerId":"KrKs","details":"Chairs measure 19 inches wide, 23 inches deep and 38 inches high.","fcomName":"Cunningham 5 Pc. Dinette","height":"30\"","customerId":"1580771","vcfURL":"http://www.valuecityfurniture.com/shared/pages/product/product.aspx?ItemId=0&ChildItemId=1580771","description":"On Target. With its lovely pairing of cherry wood tones and black paint, our Chelsea dining room will be the perfect spot for intimate gatherings. The round table has a substantial turned pedestal base, curved edge bevel and plinth-style feet. The uniquely styled chairs feature a modified X-style back with a central ring, slender, tapering legs and a shaped seat for extra dining comfort. When the look needs to be a seamless blend of classic and casual, the Chelsea collection hits the bull's-eye. Five piece package includes table and four chairs, as shown."},"status":"ENABLED","id":"VY4E"}