{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23202566.png","Dimensions":"254 cm x 68 cm x 103 cm","name":"Atlas Sofa 4S","tags":["Freedom:Menu:Sofas:Leather Sofas"],"price":"$2699","LongDescription":"OVERVIEW\r\nBig, bold and beautiful – the four-seat Atlas is a huge, sink-in sofa that’s wide enough and long enough to fall asleep on. This is a sofa that capitalises on the slab trend in European sofas, but the Atlas is not just a statement piece, it is also luxuriously comfortable and superbly finished.\r\nA key feature is the natural variations of the high-quality semi-aniline leather, which softly ages over time. Another stylish feature is the twin-stitched French seams on the leather panels. This detail complements the large scale of the sofa – room enough for all the family!\r\n \r\n“Displaying weathering through use and lightening in areas of tension, the Atlas features the well-worn handle of a vintage flight jacket.”  Freedom sofa buyer.\r\n","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/sofas/leather-sofas/23202566/atlas-4-seat-sofa-randolph-tan/","productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/leather-sofas/23202566/atlas-4-seat-sofa-randolph-tan/","partnerId":"MRqq","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/O49-ifq2Zm8o2jIUVyy2Kn7jk5I.jpg"],"thumb":["a/teBPS59DW2-v0qVXWvZft5sS4X0.jpg"]},"customerId":"23202566","description":"<p>Shown in Randolph Leather in Tan.</p>&#13;<p></p><p><strong>OVERVIEW</strong><br />&#13;\nBig, bold and beautiful &#8211; the four-seat <strong>Atlas</strong> is a huge, sink-in sofa that&#8217;s wide enough and long enough to fall asleep on. This is a sofa that capitalises on the slab trend in European sofas, but the Atlas is not just a statement piece, it is also luxuriously comfortable and superbly finished.</p>&#13;<p>A key feature is the natural variations of the high-quality semi-aniline leather, which softly ages over time. Another stylish feature is the twin-stitched French seams on the leather panels. This detail complements the large scale of the sofa &#8211; room enough for all the family!<br />&#13;\n&#160; <br />&#13;\n<em>&#8220;Displaying weathering through use and lightening in areas of tension, the Atlas features the well-worn handle of a vintage flight jacket.&#8221;</em>  Freedom sofa buyer.</p>&#13;\n&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/leather-sofas/23202566/atlas-4-seat-sofa-randolph-tan/","id":"w9wd"}