{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23120501.png","Dimensions":"60 cm x 45 cm x 50 cm","name":"Tino Ottoman","tags":["Freedom:Menu:Sofas:Ottomans"],"price":"$499","LongDescription":"OVERVIEW\r\nThere’s a retro sensibility to this smart looking sofa. Perhaps it evokes the kind of full leather seating found in big old American car interiors or perhaps it conjures up the kind of couch you might sit on during a long night of cards.\r\nWhatever the inspiration, it’s at least certain that the Tino is built for comfort. The high-back cushioning with a supportive lumbar cushion kidney gusset for lower back support, wide curved arms and thick leather upholstery makes the Tino a perennial Freedom favourite.\r\n \r\n“Add wow factor to the Tino with some printed cushions, a plush pile rug and a glass coffee table,” Freedom sofa buyer.\r\n","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/wLngBBt86py2yGqwf252zuX-3sw.jpg"],"thumb":["a/eEoDjFxga1o5pzot-Lu9ewQnnuY.jpg"]},"productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/ottomans/23120501/tino-ottoman-lawson-black/","partnerId":"MRqq","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/sofas/ottomans/23120501/tino-ottoman-lawson-black/","customerId":"23120501","description":"<p></p><p><strong>OVERVIEW</strong><br />&#13;\nThere&#8217;s a retro sensibility to this smart looking sofa. Perhaps it evokes the kind of full leather seating found in big old American car interiors or perhaps it conjures up the kind of couch you might sit on during a long night of cards.</p>&#13;<p>Whatever the inspiration, it&#8217;s at least certain that the <strong>Tino</strong> is built for comfort. The high-back cushioning with a supportive lumbar cushion kidney gusset for lower back support, wide curved arms and thick leather upholstery makes the Tino a perennial Freedom favourite.<br />&#13;\n&#160; <br />&#13;\n<em>&#8220;Add wow factor to the Tino with some printed cushions, a plush pile rug and a glass coffee table,&#8221;</em> Freedom sofa buyer.</p>&#13;\n&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/ottomans/23120501/tino-ottoman-lawson-black/","id":"f94Y"}