{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23367692.png","Dimensions":"242 cm x 85 cm x 102 cm","name":"Signature Sofa 3S","tags":["Freedom:Menu:Sofas:Fabric Sofas"],"price":"$1299","LongDescription":"OVERVIEW\r\nThe grandly proportioned Signature range appeals to the modern Brady Bunch family. It commands attention in a contemporary living room, forming a neat but expansive box shape made from a combination of sectional pieces. In fact, Signature combines the best design features of many current ranges into one coordinated, aligned collection of furniture. \r\nFeaturing a variety of fabric and leather upholstery options, as well as a diverse range of configurations (with very tempting price points!), the Signature is ideal for mix and match coordination in an elegant, contemporary décor. Covered in soft, durable Lucia semi-aniline leather or one of three fabric choices: stain-resistant micro dobby-weave Napa, basket weave Attache or chunky linen look Almeida polyester fabric, the Signature three-seat sofa has comfort well covered. On the inside, the seat fillers are of high-density foam cores wrapped in fibre for extra softness, and the loose plump back cushions are filled with a feather and fibre mix. The square track arms, low shoulders and general sleek low-profile of the Signature creates a very modern aesthetic in most homes.\r\n \r\n“All your living room options are covered in the extensive Signature collection of on-trend low-profile modern sofas.” Angus Whyte, Freedom sofa buyer.","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/PTuETP1NUqtbreQZu2dwUh0PJlg.jpg"],"thumb":["a/1lhETPiS1wHI08dhmZDLppPwm3w.jpg"]},"productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-sofas/23367692/signature-3-seat-sofa-attache-nutmeg/","partnerId":"MRqq","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-sofas/23367692/signature-3-seat-sofa-attache-nutmeg/","customerId":"23367692","description":"<p>Shown in Attache Fabric in Nutmeg.</p>&#13;<p></p><p><strong>OVERVIEW</strong><br />&#13;\nThe grandly proportioned <strong>Signature</strong> range appeals to the modern Brady Bunch family. It commands attention in a contemporary living room, forming a neat but expansive box shape made from a combination of sectional pieces. In fact, Signature combines the best design features of many current ranges into one coordinated, aligned collection of furniture. </p>&#13;<p>Featuring a variety of fabric and leather upholstery options, as well as a diverse range of configurations (with very tempting price points!), the Signature is ideal for mix and match coordination in an elegant, contemporary d&#233;cor. Covered in soft, durable Lucia semi-aniline leather or one of three fabric choices: stain-resistant micro dobby-weave Napa, basket weave Attache or chunky linen look Almeida polyester fabric, the Signature three-seat sofa has comfort well covered. On the inside, the seat fillers are of high-density foam cores wrapped in fibre for extra softness, and the loose plump back cushions are filled with a feather and fibre mix. The square track arms, low shoulders and general sleek low-profile of the Signature creates a very modern aesthetic in most homes.<br />&#13;\n&#160; <br />&#13;\n<em>&#8220;All your living room options are covered in the extensive Signature collection of on-trend low-profile modern sofas.&#8221;</em> Angus Whyte, Freedom sofa buyer.</p>&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-sofas/23367692/signature-3-seat-sofa-attache-nutmeg/","id":"r2GC"}