{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/22788344.png","Dimensions":"200 cm x 77 cm x 100 cm","name":"Cancun Dining Table 200x100cm","tags":["Freedom:Menu:Dining:Dining Tables"],"price":"$999","LongDescription":"Cancun is one of Freedom’s most popular furniture collections and it’s easy to see why. The modern whitewashed timber pieces that make up this large collection have been specifically developed for the smart and casual interior style so characteristic of Australian homes. A lot of the inspiration for the design of the Cancun collection comes from a coastal living aesthetic, but you won’t find any seashell motifs here. Cancun’s simple styling allows the range to be extremely versatile and work in with just about any contemporary décor. As for individual pieces, there are plenty of attractive details. Both the Cancun dining tables boast a generous tabletop overhang that sits on a sturdy solid Mindi timber frame. Four people can sit at the medium table and six people can sit at the larger table.\r\n\r\n“The Cancun is still our number one timber range. It’s so popular, we just keep on adding to it!” Freedom furniture buyer Lucie McCann.\r\n","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/sH5IF064aXCNE4Pb5J0YqWwR8_s.jpg"],"thumb":["a/ISvmw-6aP310lM9-sC0R45EQilM.jpg"]},"productURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/22788344/cancun-dining-table-200x100cm-white-wash/","partnerId":"MRqq","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/22788344/cancun-dining-table-200x100cm-white-wash/","customerId":"22788344","description":"<p>Cancun is one of Freedom&#8217;s most popular furniture collections and it&#8217;s easy to see why. The modern whitewashed timber pieces that make up this large collection have been specifically developed for the smart and casual interior style so characteristic of Australian homes. A lot of the inspiration for the design of the Cancun collection comes from a coastal living aesthetic, but you won&#8217;t find any seashell motifs here. Cancun&#8217;s simple styling allows the range to be extremely versatile and work in with just about any contemporary d&#233;cor. As for individual pieces, there are plenty of attractive details. Both the Cancun dining tables boast a generous tabletop overhang that sits on a sturdy solid Mindi timber frame. Four people can sit at the medium table and six people can sit at the larger table.<br />&#13;\n<br />&#13;\n&#8220;The Cancun is still our number one timber range. It&#8217;s so popular, we just keep on adding to it!&#8221; Freedom furniture buyer Lucie McCann.&#13;\n</p>&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/dining/dining-tables/22788344/cancun-dining-table-200x100cm-white-wash/","id":"TcR6"}