{"info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23364752.png","Dimensions":"76 cm x 84 cm x 89 cm","tags":["Freedom:Menu:Sofas:Occasional Chairs"],"price":"$799","description":"Scandinavian chic meets traditional wingback in this stunning statement piece for the living room. The Danish Wing has an angled back for reclining, a deep plush seat for serious relaxation and sweeping wings to shelter a napping sitter. Solid, cylindrical, dark-stained legs support a chair full of distinctive features, such as sharp angular track arms, extensive piping and loose back and seat cushions that allow for rejuvenation. For a super modern look, get it covered in citrus-hued Scooter Highlighter fabric or monochrome Essential black leather.","LongDescription":"OVERVIEW\r\nScandinavian chic meets traditional wingback in this stunning statement piece for the living room. The Danish Wing has an angled back for reclining, a deep plush seat for serious relaxation and sweeping wings to shelter a napping sitter. Solid, cylindrical, dark-stained legs support a chair full of distinctive features, such as sharp angular track arms, extensive piping and loose back and seat cushions that allow for rejuvenation.\r\nThis sleek sophisticate looks striking in any upholstery, but for a super modern look, get it covered in citrus-hued Scooter Highlighter fabric or monochrome Essential black leather.\r\n \r\n“A twist on the seminal wing chair, contemporised by a Danish design ethos,”  Freedom sofa buyer.","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-armchairs/23364752/danish-wing-chair-scooter-highlighter/","productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-armchairs/23364752/danish-wing-chair-scooter-highlighter/","partnerId":"MRqq","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/DS8i6lX20KBXOawxobhJws7FgSw.jpg"],"thumb":["a/lZYgFRCJZuIk3D4aaVCmzup7PYw.jpg"]},"customerId":"23364752","name":"Danish Wing Chair"},"status":"ENABLED","productURL":"http://www.freedomfurniture.co.nz/furniture/sofas/fabric-armchairs/23364752/danish-wing-chair-scooter-highlighter/","id":"tes4"}