{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23362147.png","Dimensions":"96 cm x 58 cm x 36 cm","name":"Signature Bookcase Low","tags":["Freedom:Menu:Living:Bookshelves & Wall Units"],"price":"$499","LongDescription":"OVERVIEW\r\nIt’s the furniture range that keeps on giving. With more than 130 pieces, the Signature Collection is more than just a new product line for the season it’s an entirely new division! Freedom has made a significant investment into the design and development of this extensive range and the result is a stylish collection of high-quality, contemporary furniture with long-term availability – yes, you can buy the bed today and come back for the wardrobe next year!\r\nProviding ongoing pleasure by adding pieces as needed is a key concept behind the creation of Signature, but equally important is the idea that Signature’s great sense of style can create overall harmony throughout a home’s décor. Fromdining tables andchairs toliving room units and occasional pieces, the Signature collection offers whole suites of furniture as comprehensive solutions for every room in the house. \r\nAs you can see, matching Signature is easy, but the pieces in this collection prove to be great mixers, too, as they look super smart with other contemporary ranges. Versatility has been assured with the choice of two modern finishes. Opt for a rich walnut-stained American oak timber veneer or a high-gloss white lacquer finish, depending on the directional look you are trying to achieve. Additionally, storage units and tables mounted on stainless steel, nickel-brushed tube frames, and some dining and occasional tables topped with high-grade tempered glass further enrich Signature’s modern appeal.","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/PIWicSmXzow6B4qeJtrtigOUwtY.jpg"],"thumb":["a/h6YvTDqVhgDj_8l06rkINJD5pwE.jpg"]},"productURL":"http://www.freedomfurniture.co.nz/furniture/signature/living/23362147/signature-bookcase-low-white/","partnerId":"MRqq","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/signature/living/23362147/signature-bookcase-low-white/","customerId":"23362147","description":"<p></p><p><strong>OVERVIEW<br />&#13;\n</strong>It&#8217;s the furniture range that keeps on giving. With more than 130 pieces, the Signature Collection is more than just a new product line for the season it&#8217;s an entirely new division! Freedom has made a significant investment into the design and development of this extensive range and the result is a stylish collection of high-quality, contemporary furniture with long-term availability &#8211; yes, you can buy the bed today and come back for the wardrobe next year!</p>&#13;<p>Providing ongoing pleasure by adding pieces as needed is a key concept behind the creation of Signature, but equally important is the idea that Signature&#8217;s great sense of style can create overall harmony throughout a home&#8217;s d&#233;cor. From&#160;<a href=\"/furniture/dining/dining-tables/\">dining tables</a> and&#160;<a href=\"/furniture/dining/dining-chairs/\">chairs</a> to&#160;<a href=\"/furniture/living/\">living room units</a> and occasional pieces, the Signature collection offers whole suites of furniture as comprehensive solutions for every room in the house. </p>&#13;<p>As you can see, matching Signature is easy, but the pieces in this collection prove to be great mixers, too, as they look super smart with other contemporary ranges. Versatility has been assured with the choice of two modern finishes. Opt for a rich walnut-stained American oak timber veneer or a high-gloss white lacquer finish, depending on the directional look you are trying to achieve. Additionally, storage units and tables mounted on stainless steel, nickel-brushed tube frames, and some dining and occasional tables topped with high-grade tempered glass further enrich Signature&#8217;s modern appeal.</p>&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/signature/living/23362147/signature-bookcase-low-white/","id":"tysA"}