{"status":"ENABLED","info":{"partnerName":"Freedom","TransparentImageURL":"http://www.freedom.com.au/IgnitionSuite/ProductCatalogue/images/product/transparent/23276789.png","Dimensions":"58 cm x 93.5 cm x 65 cm","name":"Astor Office Chair","tags":["Freedom:Menu:Home Office:Office Chairs"],"price":"$299","LongDescription":"You’ll love spending time working or studying in the stylish Astor office chair. Generously proportioned, this smart-looking chair is upholstered in either beautiful semi-aniline Randolf leather or in gorgeous Arena stain-resistant fabric. The seat is softly padded in channels to create a ripple effect for long-lasting comfort and features mobility details such as a height-adjustable, swiveling pedestal. The chair glides on nylon castors, making reaching for a file or phone easy. It also has a choice of two chrome-plated finishes on the frame: burnished nickel for the Arena Cement-covered chair or burnished bronze for the Randolph tan leather chair.\r\n\r\n“With a softly padded seat upholstered in high-quality tan leather or cement grey fabric, the Astor is a very comfortable and fashionable choice of office chair,” Freedom furniture buyer Lucie McCann.\r\n","externalWebStoreURL":"http://www.freedomfurniture.co.nz/furniture/home-office/office-chairs/23276789/astor-office-chair-arena-cement/","productURL":"http://www.freedomfurniture.co.nz/furniture/home-office/office-chairs/23276789/astor-office-chair-arena-cement/","partnerId":"MRqq","images":{"brand":"a/d1NQme6ZhI_7ZNhP42wdb_JXx2I.png","full":["a/y9qiNMmqBXK9Od4V2BhSW_K_8Hs.jpg"],"thumb":["a/-FlmGC4HMw_lgQ-PVPZJwzs3Ffs.jpg"]},"customerId":"23276789","description":"<p>You&#8217;ll love spending time working or studying in the stylish Astor office chair. Generously proportioned, this smart-looking chair is upholstered in either beautiful semi-aniline Randolf leather or in gorgeous Arena stain-resistant fabric. The seat is softly padded in channels to create a ripple effect for long-lasting comfort and features mobility details such as a height-adjustable, swiveling pedestal. The chair glides on nylon castors, making reaching for a file or phone easy. It also has a choice of two chrome-plated finishes on the frame: burnished nickel for the Arena Cement-covered chair or burnished bronze for the Randolph tan leather chair.<br />&#13;\n<strong><br />&#13;\n&#8220;With a softly padded seat upholstered in high-quality tan leather or cement grey fabric, the Astor is a very comfortable and fashionable choice of office chair,&#8221; <em>Freedom furniture buyer Lucie McCann.</em></strong><br />&#13;\n</p>&#13;\n&#13;"},"productURL":"http://www.freedomfurniture.co.nz/furniture/home-office/office-chairs/23276789/astor-office-chair-arena-cement/","id":"VbgM"}